use-docker-for-jekyll-blog.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-10-24 Mon 15:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Use docker for jekyll blog, which is the 在github中搭建用org-mode和org2jekyll发布及用lunr.js中文搜索的jekyll静态独立博客 II</title>
<meta name="author" content="yefeiyu" />
<meta name="description" content="使用docker集成jekyll的环境，一次配置，多处使用" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="/favicon.ico">
<meta name="theme-color" content="#ffffff">
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/style/toc.css"/>
<link rel="stylesheet" href="/style/tufte.css"/>
<link rel="stylesheet" href="/style/main.css"/>
<link rel="alternate" type="application/rss+xml" href="https://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

<link rel="stylesheet" href="/style/copy-pre.css"/>
<link rel="stylesheet" href="/style/clipboard.css">
<link rel="stylesheet" href="/style/custom.css">
<link rel="stylesheet" href="/style/clip2.css"/>
<button class="button" id="copy-button" data-clipboard-target="#code">Copy</button>
</head>
<body>
<div id="preamble" class="status">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-NJRFJGX"
                  height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<header>
    <a accesskey="h" href="/index.html"> HOME </a> |
    <a href="#" id="edit-in-github">EDIT</a> |
    <a href="https://yefeiyu.github.io/index.xml">RSS</a> |
    <a accesskey="H" href="/about.html">ABOUT</a> |
    <a href="https://github.com/yefeiyu">GITHUB</a>
</header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Use docker for jekyll blog, which is the 在github中搭建用org-mode和org2jekyll发布及用lunr.js中文搜索的jekyll静态独立博客 II</h1>
</header><p>
For a long time ago, I writed the blog [<a href="https://yefeiyu.github.io/soft/2016/05/02/%E5%9C%A8github%E4%B8%AD%E6%90%AD%E5%BB%BA%E7%94%A8org-mode%E5%92%8Corg2jekyll%E5%8F%91%E5%B8%83%E5%8F%8A%E7%94%A8lunr.js%E4%B8%AD%E6%96%87%E6%90%9C%E7%B4%A2%E7%9A%84jekyll%E9%9D%99%E6%80%81%E7%8B%AC%E7%AB%8B%E5%8D%9A%E5%AE%A2.html">https://yefeiyu.github.io/soft/2016/05/02/%E5%9C%A8github%E4%B8%AD%E6%90%AD%E5%BB%BA%E7%94%A8org-mode%E5%92%8Corg2jekyll%E5%8F%91%E5%B8%83%E5%8F%8A%E7%94%A8lunr.js%E4%B8%AD%E6%96%87%E6%90%9C%E7%B4%A2%E7%9A%84jekyll%E9%9D%99%E6%80%81%E7%8B%AC%E7%AB%8B%E5%8D%9A%E5%AE%A2.html</a>](《在github中搭建用org-mode和org2jekyll发布及用lunr.js中文搜索的jekyll静态独立博客》), now there is a new method of build entire environment of jekyll-blog. Use the Docker CE, only 3 steps to complete the complex methods writen in the previous blog post.
Let's start.
Install the new stretch OS of Debian 9, If we to configurate the blog environment of Ruby, Node, NPM, Grunt&#x2026;, it will waste too many times. So We use Docker.
</p>
<div id="outline-container-org71083c1" class="outline-2">
<h2 id="org71083c1">Install docker CE through Docker's official tutorial. The address is</h2>
<div class="outline-text-2" id="text-org71083c1">
<p>
[<a href="https://docs.docker.com/install/linux/docker-ce/debian/#install-using-the-repository">https://docs.docker.com/install/linux/docker-ce/debian/#install-using-the-repository</a>](Get Docker CE for Debian)
</p>
<pre class="code"><code><span style="color: #81A1C1;">sudo</span> <span style="font-weight: bold;">apt</span>-get install      apt-transport-https      ca-certificates      curl      gnupg2      software-properties-common
curl -fsSL https:<span style="color: #677691;">//</span><span style="color: #677691;">download.docker.com/linux/debian/gpg | sudo apt-key add -</span>
sudo apt-key fingerprint 0EBFCD88
sudo add-apt-repository    <span style="color: #D08770;">"deb [arch=amd64] https://download.docker.com/linux/debian \</span>
<span style="color: #D08770;">   $(lsb_release -cs) \</span>
<span style="color: #D08770;">   stable"</span>
sudo apt-get update
sudo apt-get install docker-ce
</code></pre>
</div>
</div>
<div id="outline-container-org46da7b0" class="outline-2">
<h2 id="org46da7b0">Pull my docker repository</h2>
<div class="outline-text-2" id="text-org46da7b0">
<pre class="code"><code>s docker <span style="color: #81A1C1;">pull</span> <span style="font-weight: bold;">xxmm</span>/ruby-node-grunt:v1
</code></pre>
<p>
xxmm/ruby-node-grunt:v1 FROM starefossen/ruby-node, the Dockerfile is:
</p>
<pre class="code"><code><span style="color: #81A1C1;">FROM</span> starefossen/ruby-node

<span style="color: #81A1C1;">RUN</span> apt-get update &amp;&amp; \
    apt-get -y install apt-utils sudo &amp;&amp; \
    useradd -d /home/xx -m -s /bin/bash xx &amp;&amp; \
    echo xx<span style="color: #81A1C1;">:xx</span> | chpasswd &amp;&amp; \
    adduser xx sudo &amp;&amp; \
    npm install -g bower grunt-cli
<span style="color: #81A1C1;">USER</span> xx
<span style="color: #81A1C1;">RUN</span> mkdir /home/xx/.ssh/ &amp;&amp; \
    mkdir /home/xx/mt/ &amp;&amp; \
    mkdir -<span style="color: #81A1C1;">p</span> /home/xx/gh/yefeiyu.github.io/
<span style="color: #81A1C1;">COPY</span> .bash_aliases /home/xx/
<span style="color: #81A1C1;">COPY</span> <span style="color: #81A1C1;">Gemfile</span> /home/xx/gh/yefeiyu.github.io/
<span style="color: #81A1C1;">COPY</span> package.json /home/xx/gh/yefeiyu.github.io/
<span style="color: #81A1C1;">WORKDIR</span> /home/xx/gh/yefeiyu.github.io/
<span style="color: #81A1C1;">RUN</span> bundle install &amp;&amp; \
    rm *
</code></pre>
<p>
As we seen, which add the user of xx, and created the environment needed for the blog. The steps is created 3 folders, copy 3 documents which build environment needed and bundle install. 
</p>
</div>
</div>
<div id="outline-container-org6ba4bbe" class="outline-2">
<h2 id="org6ba4bbe">Use docker for jekyll blog</h2>
<div class="outline-text-2" id="text-org6ba4bbe">
<pre class="code"><code><span style="color: #81A1C1;">docker</span> <span style="font-weight: bold;">run</span> -ti --rm -u 0 -p 4321:4321 -p 35729:35729 -v /home/xx/gh/yefeiyu.github.io/:/home/xx/gh/yefeiyu.github.io/ -v /home/xx/.ssh/:/home/xx/.ssh/ xxmm/ruby-node-grunt:v1 grunt serve
</code></pre>

<p>
It's so simple! 
If we want to use docker under Windows 10, which need to OPEN the hyper-V in windows system settings of applications.
</p>
</div>
</div>
<div id="outline-container-org4533866" class="outline-2">
<h2 id="org4533866">Because I mount github.io folder by -v, I need git clone the git repository first, and write the blog at local.</h2>
<div class="outline-text-2" id="text-org4533866">
<p>
The local need the node_modules folder.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <p>Author: yefeiyu <a aria-label="Follow @yefeiyu on GitHub" data-count-aria-label="# followers on GitHub" data-count-api="/users/jcouyang#followers" data-count-href="/jcouyang/followers" href="https://github.com/yefeiyu class="github-button">Follow @yefeiyu</a></p>
  <p>Modified: 2022-10-22 Sat 16:50</p>
  <p>Generated by: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.3) &#215; <a href="https://github.com/jcouyang/orgpress">OrgPress</a></p>
</footer>
</div>
</body>
</html>
